#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
environments/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/ecs-terraform/ecs-terraform/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/ecs-terraform/ecs-terraform

To view this run in a browser, visit:
https://app.terraform.io/app/machamp/sample-workspace/runs/run-K3QgKfu5zncB2ZyW

Waiting for the plan to start...

Terraform v0.14.8
Configuring remote state backend...
Initializing Terraform configuration...
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=machamp-repository]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster]
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-0aab2a35812cd282e]
module.cloudwatch_logs.aws_cloudwatch_log_group.logs: Refreshing state... [id=/machamp/staging/ecs]
module.ecs.module.ecs_task_execution_role.aws_iam_role.iam_role: Refreshing state... [id=ecs-task-execution]
module.ecs.aws_ecs_task_definition.taskdef: Refreshing state... [id=staging]
module.ecs.module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::762742784206:policy/ecs-task-execution]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle: Refreshing state... [id=machamp-repository]
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20210725034824703300000001]
module.db_sg.aws_security_group.this: Refreshing state... [id=sg-0c471743b402d8a50]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-0b55c470ad9beba88]
module.redis_sg.aws_security_group.this: Refreshing state... [id=sg-0b6b2172500917b43]
module.ecs_task_sg.aws_security_group.this: Refreshing state... [id=sg-0d595f0d535307a57]
module.network.aws_route_table.public: Refreshing state... [id=rtb-0d6fad90de691068a]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0ba428b39b3a9a876]
module.alb_sg.aws_security_group.this: Refreshing state... [id=sg-0b6343de71c6623e0]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-09d9b7a88814fccee]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-0631173a41ee71ad3]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-093d5d5def00ce051]
module.network.aws_route.public: Refreshing state... [id=r-rtb-0d6fad90de691068a1080289494]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1409660102]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0744a52995ce83217]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-0aa8abfe8c364c20c]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[2]: Refreshing state... [id=sgrule-4153356714]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-1430121002]
module.alb_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3079447530]
module.ecs_task_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2110978362]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/c2dea9b74442a8b0]
module.ecs_task_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1744209424]
module.elasticache.aws_elasticache_subnet_group.this: Refreshing state... [id=machamp-staging-redis-subnet-group]
module.db_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1270807590]
module.redis_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2328974682]
module.redis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-749467129]
module.db_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1494005750]
module.elasticache.aws_elasticache_replication_group.this: Refreshing state... [id=machamp-staging-redis]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb_listener.this[0] will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/c2dea9b74442a8b0"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_listener.this[1] will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/c2dea9b74442a8b0"
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.this[0] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "staging-target-group-for-users"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0aab2a35812cd282e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 60
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.this[1] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "staging-target-group-for-test"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0aab2a35812cd282e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 60
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "machamp-staging-service"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:762742784206:task-definition/staging:24"
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "CODE_DEPLOY"
        }

      + load_balancer {
          + container_name   = "app"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }
      + load_balancer {
          + container_name   = "app"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0d595f0d535307a57",
            ]
          + subnets          = [
              + "subnet-093d5d5def00ce051",
              + "subnet-09d9b7a88814fccee",
            ]
        }
    }

  # module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "machamp-staging-subnet-group"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.20"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "machamp-staging-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + option_group_name                     = "machamp-staging"
      + parameter_group_name                  = "machamp-staging"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = [
          + "sg-0c471743b402d8a50",
        ]
    }

  # module.rds.aws_db_option_group.this will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "8.0"
      + name                     = "machamp-staging"
      + name_prefix              = (known after apply)
      + option_group_description = "machamp-staging option group"
      + tags_all                 = (known after apply)
    }

  # module.rds.aws_db_parameter_group.this will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "machamp-staging parameter group"
      + family      = "mysql8.0"
      + id          = (known after apply)
      + name        = "machamp-staging"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.rds.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "machamp-staging-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-0631173a41ee71ad3",
          + "subnet-0b55c470ad9beba88",
        ]
      + tags_all    = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

</details>